#  编写一个SQL查询以计算每位员工每天在办公室花费的总时间（以分钟为单位）。 请注意，在一天之内，同一员工是可以多次进入和离开办公室的。 在办公室里一次进出所花费的时间为out_time 减去 in_time。
# 
#  返回结果表单的顺序无要求。
#  查询结果的格式如下：
# 
#  Employees table:
#      +--------+------------+---------+----------+
#      | emp_id | event_day  | in_time | out_time |
#      +--------+------------+---------+----------+
#      | 1      | 2020-11-28 | 4       | 32       |
#      | 1      | 2020-11-28 | 55      | 200      |
#      | 1      | 2020-12-03 | 1       | 42       |
#      | 2      | 2020-11-28 | 3       | 33       |
#      | 2      | 2020-12-09 | 47      | 74       |
#  +--------+------------+---------+----------+
#      Result table:
#      +------------+--------+------------+
#      | day        | emp_id | total_time |
#      +------------+--------+------------+
#      | 2020-11-28 | 1      | 173        |
#      | 2020-11-28 | 2      | 30         |
#      | 2020-12-03 | 1      | 41         |
#      | 2020-12-09 | 2      | 27         |
#  +------------+--------+------------+


select event_day as day, emp_id, sum(out_time - in_time) as total_time
from Employees
group by event_day, emp_id;